@выбрать самыф длиннчй сингл из альбомов
#AVING оставляем только те группы, где количество записей равно 1. Это и есть наши синглы.
#Основной запрос: Мы выбираем названия и длительность треков, чьи album_id попали в список синглов.
#Сортировка и лимит: Сортируем результат по убыванию длительности (DESC) и забираем только первую строку (LIMIT 1), чтобы получить самый длинный трек.

SELECT 
    name, 
    duration_ms
FROM d_track
WHERE album_id IN (
    -- Находим ID альбомов, в которых только 1 трек
    SELECT album_id
    FROM d_track
    GROUP BY album_id
    HAVING COUNT(id) = 1
)
ORDER BY duration_ms DESC
LIMIT 1
